apache/nuttx/arch/arm/src/tiva/hardware/cc13x2_cc26x2/cc13x2_cc26x2_ddi0_osc.h
#define TIVA_DDI0_OSC_DIR                        (TIVA_AUX_DDI0_OSC_BASE + TIVA_DDI_DIR_OFFSET)
#define TIVA_DDI0_OSC_SET                        (TIVA_AUX_DDI0_OSC_BASE + TIVA_DDI_SET_OFFSET)
#define TIVA_DDI0_OSC_CLR                        (TIVA_AUX_DDI0_OSC_BASE + TIVA_DDI_CLR_OFFSET)
#define TIVA_DDI0_OSC_MASK4B                     (TIVA_AUX_DDI0_OSC_BASE + TIVA_DDI_MASK4B_OFFSET)
#define TIVA_DDI0_OSC_MASK8B                     (TIVA_AUX_DDI0_OSC_BASE + TIVA_DDI_MASK8B_OFFSET)
#define TIVA_DDI0_OSC_MASK16B                    (TIVA_AUX_DDI0_OSC_BASE + TIVA_DDI_MASK16B_OFFSET)

/* DDI0 OSC Bitfield Definitions ************************************************************************************/

/* DDI0_OSC_CTL0 */

#define DDI0_OSC_CTL0_SCLK_HF_SRC_SEL               (1 << 0)  /* Bit 0:  Source select for sclk_hf */
#  define DDI0_OSC_CTL0_SCLK_HF_SRC_RCOSC           (0)       /* High frequency RCOSC clock */
#  define DDI0_OSC_CTL0_SCLK_HF_SRC_XOSC            DDI0_OSC_CTL0_SCLK_HF_SRC_SEL /* High frequency XOSC clock */
#define DDI0_OSC_CTL0_SCLK_LF_SRC_SEL_SHIFT         (2)       /* Bits 2-3: Source select for sclk_lf */
#define DDI0_OSC_CTL0_SCLK_LF_SRC_SEL_MASK          (3 << DDI0_OSC_CTL0_SCLK_LF_SRC_SEL_SHIFT)
#  define DDI0_OSC_CTL0_SCLK_LF_SRC_SEL_XOSCHFDLF   (1 << DDI0_OSC_CTL0_SCLK_LF_SRC_SEL_SHIFT) /* Low frequency clock derived
                                                                                                * from High Frequency XOSC */
#  define DDI0_OSC_CTL0_SCLK_LF_SRC_SEL_RCOSCHFDLF  (0 << DDI0_OSC_CTL0_SCLK_LF_SRC_SEL_SHIFT) /* Low frequency clock derived
                                                                                                * from High Frequency RCOSC */
#  define DDI0_OSC_CTL0_SCLK_LF_SRC_SEL_RCOSCLF     (2 << DDI0_OSC_CTL0_SCLK_LF_SRC_SEL_SHIFT) /* Low frequency RCOSC */
#  define DDI0_OSC_CTL0_SCLK_LF_SRC_SEL_XOSCLF      (3 << DDI0_OSC_CTL0_SCLK_LF_SRC_SEL_SHIFT) /* Low frequency XOSC */
#define DDI0_OSC_CTL0_ACLK_REF_SRC_SEL_SHIFT        (4)       /* Bits 4-6:  Source select for aclk_ref */
#define DDI0_OSC_CTL0_ACLK_REF_SRC_SEL_MASK         (7 << DDI0_OSC_CTL0_ACLK_REF_SRC_SEL_SHIFT)
#  define DDI0_OSC_CTL0_ACLK_REF_SRC_RCOSCHF        (0 << DDI0_OSC_CTL0_ACLK_REF_SRC_SEL_SHIFT) /* RCOSC_HF derived (31.25kHz) */
#  define DDI0_OSC_CTL0_ACLK_REF_SRC_XOSCHF         (1 << DDI0_OSC_CTL0_ACLK_REF_SRC_SEL_SHIFT) /* XOSC_HF derived (31.25kHz) */
#  define DDI0_OSC_CTL0_ACLK_REF_SRC_RCOSCLF        (2 << DDI0_OSC_CTL0_ACLK_REF_SRC_SEL_SHIFT) /* RCOSC_LF (32kHz) */
#  define DDI0_OSC_CTL0_ACLK_REF_SRC_XOSCLF         (3 << DDI0_OSC_CTL0_ACLK_REF_SRC_SEL_SHIFT) /*  XOSC_LF (32.768kHz) */
#  define DDI0_OSC_CTL0_ACLK_REF_SRC_RCOSCMF        (4 << DDI0_OSC_CTL0_ACLK_REF_SRC_SEL_SHIFT) /* RCOSC_MF (2MHz) */
#define DDI0_OSC_CTL0_ACLK_TDC_SRC_SEL_SHIFT        (7)       /* Bits 7-8: ource select for aclk_tdc */
#define DDI0_OSC_CTL0_ACLK_TDC_SRC_SEL_MASK         (3 << DDI0_OSC_CTL0_ACLK_TDC_SRC_SEL_SHIFT)
#  define DDI0_OSC_CTL0_ACLK_TDC_SRC_RCOSCHF48      (0 << DDI0_OSC_CTL0_ACLK_TDC_SRC_SEL_SHIFT) /* RCOSC_HF (48MHz) */
#  define DDI0_OSC_CTL0_ACLK_TDC_SRC_RCOSCHF24      (1 << DDI0_OSC_CTL0_ACLK_TDC_SRC_SEL_SHIFT) /* RCOSC_HF (24MHz) */
#  define DDI0_OSC_CTL0_ACLK_TDC_SRC_XOSCHF24       (2 << DDI0_OSC_CTL0_ACLK_TDC_SRC_SEL_SHIFT) /* XOSC_HF (24MHz) */
#define DDI0_OSC_CTL0_CLK_LOSS_EN                   (1 << 9)  /* Bit 9:  Enable SCLK_HF, SCLK_MF and SCLK_LF clock
                                                               * loss detection and indicators to the system
                                                               * controller */
#define DDI0_OSC_CTL0_XOSC_LF_DIG_BYPASS            (1 << 10) /* Bit 10: Bypass XOSC_LF and use the digital
                                                               * input clock from AON for the xosc_lf */
#  define DDI0_OSC_CTL0_XOSC_LF_DIG_32KHZ           (0)                                         /* Use 32kHz XOSC as xosc_lf
                                                                                                 * clock source */
#  define DDI0_OSC_CTL0_XOSC_LF_DIG_DIGINPUT        DDI0_OSC_CTL0_XOSC_LF_DIG_BYPASS            /* Use digital input (from AON)
                                                                                                 * as xosc_lf clock source */
#define DDI0_OSC_CTL0_XOSC_HF_POWER_MODE            (1 << 11) /* Bit 11 */
#define DDI0_OSC_CTL0_RCOSC_LF_TRIMMED              (1 << 12) /* Bit 12 */
#define DDI0_OSC_CTL0_HPOSC_MODE_EN                 (1 << 14) /* Bit 14 */
#define DDI0_OSC_CTL0_CLK_DCDC_SRC_SEL              (1 << 24) /* Bit 24: Select DCDC clock source
                                                               * 0=CLK_DCDC is 48 MHz clock from RCOSC or XOSC/HPOSC
                                                               * 1=CLK_DCDC is always 48 MHz clock from RCOSC */
#define DDI0_OSC_CTL0_DOUBLER_RESET_DURATION        (1 << 25) /* Bit 25 */
#define DDI0_OSC_CTL0_DOUBLER_START_DURATION_SHIFT  (26)      /* Bits 16-27 */
#define DDI0_OSC_CTL0_DOUBLER_START_DURATION_MASK   (3 << DDI0_OSC_CTL0_DOUBLER_START_DURATION_SHIFT)
#  define DDI0_OSC_CTL0_DOUBLER_START_DURATION(n)   ((uint32_t)(n) << DDI0_OSC_CTL0_DOUBLER_START_DURATION_SHIFT)
#define DDI0_OSC_CTL0_BYPASS_RCOSC_LF_CLK_QUAL      (1 << 28) /* Bit 28 */
#define DDI0_OSC_CTL0_BYPASS_XOSC_LF_CLK_QUAL       (1 << 29) /* Bit 29 */
#define DDI0_OSC_CTL0_XTAL_IS_24M                   (1 << 31) /* Bit 31: Set based high frequency XTAL */
#  define DDI0_OSC_CTL0_XTAL_IS_24M_48M             (0)
#  define DDI0_OSC_CTL0_XTAL_IS_24M_24M             DDI0_OSC_CTL0_XTAL_IS_24M

/* DDI0_OSC_CTL1 */

#define DDI0_OSC_CTL1_XOSC_HF_FAST_START_SHIFT  (0)       /* Bits 0-7 */
#define DDI0_OSC_CTL1_XOSC_HF_FAST_START_MASK   (3 << DDI0_OSC_CTL1_XOSC_HF_FAST_START_SHIFT)
#  define DDI0_OSC_CTL1_XOSC_HF_FAST_START(n)   ((uint32_t)(n) << DDI0_OSC_CTL1_XOSC_HF_FAST_START_SHIFT)
#define DDI0_OSC_CTL1_RCOSCHFCTRIMFRACT_EN      (1 << 17) /* Bit 17 */
#define DDI0_OSC_CTL1_RCOSCHFCTRIMFRACT_SHIFT   (18)      /* Bits 18-22 */
#define DDI0_OSC_CTL1_RCOSCHFCTRIMFRACT_MASK    (31 << DDI0_OSC_CTL1_RCOSCHFCTRIMFRACT_SHIFT)
#  define DDI0_OSC_CTL1_RCOSCHFCTRIMFRACT(n)    ((uint32_t)(n) << DDI0_OSC_CTL1_RCOSCHFCTRIMFRACT_SHIFT)

