apache/nuttx/arch/arm/src/tiva/hardware/cc13x2_cc26x2/cc13x2_cc26x2_ddi0_osc.h
/* DDI0_OSC_RADCEXTCFG */

#define DDI0_OSC_RADCEXTCFG_RADC_MODE_IS_SAR         (1 << 5)  /* Bit 5 */
#define DDI0_OSC_RADCEXTCFG_RADC_DAC_TH_SHIFT        (6)       /* Bits 6-11 */
#define DDI0_OSC_RADCEXTCFG_RADC_DAC_TH_MASK         (0x3f << DDI0_OSC_RADCEXTCFG_RADC_DAC_TH_SHIFT)
#  define DDI0_OSC_RADCEXTCFG_RADC_DAC_TH(n)         ((uint32_t)(n) << DDI0_OSC_RADCEXTCFG_RADC_DAC_TH_SHIFT)
#define DDI0_OSC_RADCEXTCFG_IDAC_STEP_SHIFT          (12)      /* Bits 12-15 */
#define DDI0_OSC_RADCEXTCFG_IDAC_STEP_MASK           (15 << DDI0_OSC_RADCEXTCFG_IDAC_STEP_SHIFT)
#  define DDI0_OSC_RADCEXTCFG_IDAC_STEP(n)           ((uint32_t)(n) << DDI0_OSC_RADCEXTCFG_IDAC_STEP_SHIFT)
#define DDI0_OSC_RADCEXTCFG_LPM_IBIAS_WAIT_CNT_SHIFT (16)      /* Bits 16-21 */
#define DDI0_OSC_RADCEXTCFG_LPM_IBIAS_WAIT_CNT_MASK  (0x3f << DDI0_OSC_RADCEXTCFG_LPM_IBIAS_WAIT_CNT_SHIFT)
#  define DDI0_OSC_RADCEXTCFG_LPM_IBIAS_WAIT_CNT(n)  ((uint32_t)(n) << DDI0_OSC_RADCEXTCFG_LPM_IBIAS_WAIT_CNT_SHIFT)
#define DDI0_OSC_RADCEXTCFG_HPM_IBIAS_WAIT_CNT_SHIFT (22)      /* Bits 22-31 */
#define DDI0_OSC_RADCEXTCFG_HPM_IBIAS_WAIT_CNT_MASK  (0x3ff << DDI0_OSC_RADCEXTCFG_HPM_IBIAS_WAIT_CNT_SHIFT)
#  define DDI0_OSC_RADCEXTCFG_HPM_IBIAS_WAIT_CNT(n)  ((uint32_t)(n) << DDI0_OSC_RADCEXTCFG_HPM_IBIAS_WAIT_CNT_SHIFT)

/* DDI0_OSC_AMPCOMPCTL */

#define DDI0_OSC_AMPCOMPCTL_IBIASCAP_HPTOLP_OL_CNT_SHIFT     (0)       /* Bits 0-3 */
#define DDI0_OSC_AMPCOMPCTL_IBIASCAP_HPTOLP_OL_CNT_MASK      (15 << DDI0_OSC_AMPCOMPCTL_IBIASCAP_HPTOLP_OL_CNT_SHIFT)
#  define DDI0_OSC_AMPCOMPCTL_IBIASCAP_HPTOLP_OL_CNT(n)      ((uint32_t)(n) << DDI0_OSC_AMPCOMPCTL_IBIASCAP_HPTOLP_OL_CNT_SHIFT)
#define DDI0_OSC_AMPCOMPCTL_CAP_STEP_SHIFT                   (4)       /* Bits 4-7 */
#define DDI0_OSC_AMPCOMPCTL_CAP_STEP_MASK                    (15 << DDI0_OSC_AMPCOMPCTL_CAP_STEP_SHIFT)
#  define DDI0_OSC_AMPCOMPCTL_CAP_STEP(n)                    ((uint32_t)(n) << DDI0_OSC_AMPCOMPCTL_CAP_STEP_SHIFT)
#define DDI0_OSC_AMPCOMPCTL_LPM_IBIAS_WAIT_CNT_FINAL_SHIFT   (8)       /* Bits 8-15 */
#define DDI0_OSC_AMPCOMPCTL_LPM_IBIAS_WAIT_CNT_FINAL_MASK    (0xff << DDI0_OSC_AMPCOMPCTL_LPM_IBIAS_WAIT_CNT_FINAL_SHIFT)
#  define DDI0_OSC_AMPCOMPCTL_LPM_IBIAS_WAIT_CNT_FINAL(n)    ((uint32_t)(n) << DDI0_OSC_AMPCOMPCTL_LPM_IBIAS_WAIT_CNT_FINAL_SHIFT)
#define DDI0_OSC_AMPCOMPCTL_IBIAS_INIT_SHIFT                 (16)      /* Bits 16-19 */
#define DDI0_OSC_AMPCOMPCTL_IBIAS_INIT_MASK                  (15 << DDI0_OSC_AMPCOMPCTL_IBIAS_INIT_SHIFT)
#  define DDI0_OSC_AMPCOMPCTL_IBIAS_INIT(n)                  ((uint32_t)(n) << DDI0_OSC_AMPCOMPCTL_IBIAS_INIT_SHIFT)
#define DDI0_OSC_AMPCOMPCTL_IBIAS_OFFSET_SHIFT               (20)      /* Bits 20-23 */
#define DDI0_OSC_AMPCOMPCTL_IBIAS_OFFSET_MASK                (15 << DDI0_OSC_AMPCOMPCTL_IBIAS_OFFSET_SHIFT)
#  define DDI0_OSC_AMPCOMPCTL_IBIAS_OFFSET(n)                ((uint32_t)(n) << DDI0_OSC_AMPCOMPCTL_IBIAS_OFFSET_SHIFT)
#define DDI0_OSC_AMPCOMPCTL_AMPCOMP_SW_EN                    (1 << 26) /* Bit 26 */
#define DDI0_OSC_AMPCOMPCTL_AMPCOMP_SW_CTRL                  (1 << 27) /* Bit 27 */
#define DDI0_OSC_AMPCOMPCTL_AMPCOMP_FSM_UPDATE_RATE_SHIFT    (28)      /* Bits 28-29 */
#define DDI0_OSC_AMPCOMPCTL_AMPCOMP_FSM_UPDATE_RATE_MASK     (3 << DDI0_OSC_AMPCOMPCTL_AMPCOMP_FSM_UPDATE_RATE_SHIFT)
#  define DDI0_OSC_AMPCOMPCTL_AMPCOMP_FSM_UPDATE_RATE_2MHZ   (0 << DDI0_OSC_AMPCOMPCTL_AMPCOMP_FSM_UPDATE_RATE_SHIFT)
#  define DDI0_OSC_AMPCOMPCTL_AMPCOMP_FSM_UPDATE_RATE_1MHZ   (1 << DDI0_OSC_AMPCOMPCTL_AMPCOMP_FSM_UPDATE_RATE_SHIFT)
#  define DDI0_OSC_AMPCOMPCTL_AMPCOMP_FSM_UPDATE_RATE_500KHZ (2 << DDI0_OSC_AMPCOMPCTL_AMPCOMP_FSM_UPDATE_RATE_SHIFT)
#  define DDI0_OSC_AMPCOMPCTL_AMPCOMP_FSM_UPDATE_RATE_250KHZ (3 << DDI0_OSC_AMPCOMPCTL_AMPCOMP_FSM_UPDATE_RATE_SHIFT)
#define DDI0_OSC_AMPCOMPCTL_AMPCOMP_REQ_MODE                 (1 << 30) /* Bit 30 */

/* DDI0_OSC_AMPCOMPTH1 */

#define DDI0_OSC_AMPCOMPTH1_HPMRAMP1_TH_SHIFT            (0)       /* Bits 0-5 */
#define DDI0_OSC_AMPCOMPTH1_HPMRAMP1_TH_MASK             (0x3f << DDI0_OSC_AMPCOMPTH1_HPMRAMP1_TH_SHIFT)
#  define DDI0_OSC_AMPCOMPTH1_HPMRAMP1_TH(n)             ((uint32_t)(n) << DDI0_OSC_AMPCOMPTH1_HPMRAMP1_TH_SHIFT)
#define DDI0_OSC_AMPCOMPTH1_IBIASCAP_LPTOHP_OL_CNT_SHIFT (6)       /* Bits 6-9 */
#define DDI0_OSC_AMPCOMPTH1_IBIASCAP_LPTOHP_OL_CNT_MASK  (15 << DDI0_OSC_AMPCOMPTH1_IBIASCAP_LPTOHP_OL_CNT_SHIFT)
#  define DDI0_OSC_AMPCOMPTH1_IBIASCAP_LPTOHP_OL_CNT(n)  ((uint32_t)(n) << DDI0_OSC_AMPCOMPTH1_IBIASCAP_LPTOHP_OL_CNT_SHIFT)
#define DDI0_OSC_AMPCOMPTH1_HPMRAMP3_HTH_SHIFT           (10)      /* Bits 10-15 */
#define DDI0_OSC_AMPCOMPTH1_HPMRAMP3_HTH_MASK            (0x3f << DDI0_OSC_AMPCOMPTH1_HPMRAMP3_HTH_SHIFT)
#  define DDI0_OSC_AMPCOMPTH1_HPMRAMP3_HTH(n)            ((uint32_t)(n) << DDI0_OSC_AMPCOMPTH1_HPMRAMP3_HTH_SHIFT)
#define DDI0_OSC_AMPCOMPTH1_HPMRAMP3_LTH_SHIFT           (18)      /* Bits 18-23 */
#define DDI0_OSC_AMPCOMPTH1_HPMRAMP3_LTH_MASK            (0x3f << DDI0_OSC_AMPCOMPTH1_HPMRAMP3_LTH_SHIFT)
#  define DDI0_OSC_AMPCOMPTH1_HPMRAMP3_LTH(n)            ((uint32_t)(n) << DDI0_OSC_AMPCOMPTH1_HPMRAMP3_LTH_SHIFT)

/* DDI0_OSC_AMPCOMPTH2 */

#define DDI0_OSC_AMPCOMPTH2_ADC_COMP_AMPTH_HPM_SHIFT (2)       /* Bits 2-7 */
#define DDI0_OSC_AMPCOMPTH2_ADC_COMP_AMPTH_HPM_MASK  (0x3f << DDI0_OSC_AMPCOMPTH2_ADC_COMP_AMPTH_HPM_SHIFT)
#  define DDI0_OSC_AMPCOMPTH2_ADC_COMP_AMPTH_HPM(n)  ((uint32_t)(n) << DDI0_OSC_AMPCOMPTH2_ADC_COMP_AMPTH_HPM_SHIFT)
#define DDI0_OSC_AMPCOMPTH2_ADC_COMP_AMPTH_LPM_SHIFT (10)      /* Bits 10-15 */
#define DDI0_OSC_AMPCOMPTH2_ADC_COMP_AMPTH_LPM_MASK  (0x3f << DDI0_OSC_AMPCOMPTH2_ADC_COMP_AMPTH_LPM_SHIFT)
#  define DDI0_OSC_AMPCOMPTH2_ADC_COMP_AMPTH_LPM(n)  ((uint32_t)(n) << DDI0_OSC_AMPCOMPTH2_ADC_COMP_AMPTH_LPM_SHIFT)
#define DDI0_OSC_AMPCOMPTH2_LPMUPDATE_HTH_SHIFT      (18)      /* Bits 18-23 */
#define DDI0_OSC_AMPCOMPTH2_LPMUPDATE_HTH_MASK       (0x3f << DDI0_OSC_AMPCOMPTH2_LPMUPDATE_HTH_SHIFT)
#  define DDI0_OSC_AMPCOMPTH2_LPMUPDATE_HTH(n)       ((uint32_t)(n) << DDI0_OSC_AMPCOMPTH2_LPMUPDATE_HTH_SHIFT)
#define DDI0_OSC_AMPCOMPTH2_LPMUPDATE_LTH_SHIFT      (26)      /* Bits 26-31 */
#define DDI0_OSC_AMPCOMPTH2_LPMUPDATE_LTH_MASK       (0x3f << DDI0_OSC_AMPCOMPTH2_LPMUPDATE_LTH_SHIFT)
#  define DDI0_OSC_AMPCOMPTH2_LPMUPDATE_LTH(n)       ((uint32_t)(n) << DDI0_OSC_AMPCOMPTH2_LPMUPDATE_LTH_SHIFT)

