apache/nuttx/arch/arm/src/tiva/hardware/cc13x2_cc26x2/cc13x2_cc26x2_ddi0_osc.h
/* DDI0_OSC_ANABYPASSVAL1 */

#define DDI0_OSC_ANABYPASSVAL1_XOSC_HF_COLUMN_Q12_SHIFT (0)       /* Bits 0-15 */
#define DDI0_OSC_ANABYPASSVAL1_XOSC_HF_COLUMN_Q12_MASK  (0xffff << DDI0_OSC_ANABYPASSVAL1_XOSC_HF_COLUMN_Q12_SHIFT)
#  define DDI0_OSC_ANABYPASSVAL1_XOSC_HF_COLUMN_Q12(n)  ((uint32_t)(n) << DDI0_OSC_ANABYPASSVAL1_XOSC_HF_COLUMN_Q12_SHIFT)
#define DDI0_OSC_ANABYPASSVAL1_XOSC_HF_ROW_Q12_SHIFT    (16)      /* Bits 16-19 */
#define DDI0_OSC_ANABYPASSVAL1_XOSC_HF_ROW_Q12_MASK     (15 << DDI0_OSC_ANABYPASSVAL1_XOSC_HF_ROW_Q12_SHIFT)
#  define DDI0_OSC_ANABYPASSVAL1_XOSC_HF_ROW_Q12(n)     ((uint32_t)(n) << DDI0_OSC_ANABYPASSVAL1_XOSC_HF_ROW_Q12_SHIFT)

/* DDI0_OSC_ANABYPASSVAL2 */

#define DDI0_OSC_ANABYPASSVAL2_XOSC_HF_IBIASTHERM_SHIFT (0)       /* Bits 0-13 */
#define DDI0_OSC_ANABYPASSVAL2_XOSC_HF_IBIASTHERM_MASK  (0x3fff << DDI0_OSC_ANABYPASSVAL2_XOSC_HF_IBIASTHERM_SHIFT)
#  define DDI0_OSC_ANABYPASSVAL2_XOSC_HF_IBIASTHERM(n)  ((uint32_t)(n) << DDI0_OSC_ANABYPASSVAL2_XOSC_HF_IBIASTHERM_SHIFT)

/* DDI0_OSC_ATESTCTL */

#define DDI0_OSC_ATESTCTL_ATEST_RCOSCMF_SHIFT       (12)      /* Bits 12-13 ATEST control for RCOSC_MF */
#define DDI0_OSC_ATESTCTL_ATEST_RCOSCMF_MASK        (3 << DDI0_OSC_ATESTCTL_ATEST_RCOSCMF_SHIFT)
#  define DDI0_OSC_ATESTCTL_ATEST_RCOSCMF_DISABLE   (0 << DDI0_OSC_ATESTCTL_ATEST_RCOSCMF_SHIFT) /* ATEST disabled */
#  define DDI0_OSC_ATESTCTL_ATEST_RCOSCMF_VDDLOCAL  (1 << DDI0_OSC_ATESTCTL_ATEST_RCOSCMF_SHIFT) /* ATEST enabled, VDD_LOCAL connected,
                                                                                                  * ATEST internal to RCOSC_MF enabled
                                                                                                  * to send out 2MHz clock. */
#  define DDI0_OSC_ATESTCTL_ATEST_RCOSCMF_BIAS      (3 << DDI0_OSC_ATESTCTL_ATEST_RCOSCMF_SHIFT) /* ATEST enabled, bias current connected,
                                                                                                  * ATEST internal to RCOSC_MF enabled
                                                                                                  * to send out 2MHz clock. */
#define DDI0_OSC_ATESTCTL_TEST_RCOSCMF_SHIFT      (14)      /* Bits 14-15: Test mode control for RCOSC_MF */
#define DDI0_OSC_ATESTCTL_TEST_RCOSCMF_MASK       (3 << DDI0_OSC_ATESTCTL_TEST_RCOSCMF_SHIFT)
#  define DDI0_OSC_ATESTCTL_TEST_RCOSCMF_DISABLE  (0 << DDI0_OSC_ATESTCTL_TEST_RCOSCMF_SHIFT)   /* Test modes disabled */
#  define DDI0_OSC_ATESTCTL_TEST_RCOSCMF_BOOST    (1 << DDI0_OSC_ATESTCTL_TEST_RCOSCMF_SHIFT)   /* Boosted bias current into self
                                                                                                 * biased inverter */
#  define DDI0_OSC_ATESTCTL_TEST_RCOSCMF_QUALDIS  (2 << DDI0_OSC_ATESTCTL_TEST_RCOSCMF_SHIFT)   /* Clock qualification disabled */
#  define DDI0_OSC_ATESTCTL_TEST_RCOSCMF_BOOSTDIS (3 << DDI0_OSC_ATESTCTL_TEST_RCOSCMF_SHIFT)   /* Boosted bias current into self
                                                                                                 * biased inverter + clock qualification
                                                                                                 * disabled */
#define DDI0_OSC_ATESTCTL_SCLK_LF_AUX_EN          (1 << 31) /* Bit 31: Enable 32 kHz clock to AUX_COMPB */

/* DDI0_OSC_ADCDOUBLERNANOAMPCTL */

#define DDI0_OSC_ADCDOUBLERNANOAMPCTL_ADC_IREF_CTRL_SHIFT  (0)       /* Bits 0-1 */
#define DDI0_OSC_ADCDOUBLERNANOAMPCTL_ADC_IREF_CTRL_MASK   (3 << DDI0_OSC_ADCDOUBLERNANOAMPCTL_ADC_IREF_CTRL_SHIFT)
#  define DDI0_OSC_ADCDOUBLERNANOAMPCTL_ADC_IREF_CTRL(n)   ((uint32_t)(n) << DDI0_OSC_ADCDOUBLERNANOAMPCTL_ADC_IREF_CTRL_SHIFT)
#define DDI0_OSC_ADCDOUBLERNANOAMPCTL_ADC_SH_VBUF_EN       (1 << 4)  /* Bit 4 */
#define DDI0_OSC_ADCDOUBLERNANOAMPCTL_ADC_SH_MODE_EN       (1 << 5)  /* Bit 5 */
#define DDI0_OSC_ADCDOUBLERNANOAMPCTL_SPARE23              (1 << 23) /* Bit 23 */
#define DDI0_OSC_ADCDOUBLERNANOAMPCTL_NANOAMP_BIAS_ENABLE  (1 << 24) /* Bit 24 */

/* DDI0_OSC_XOSCHFCTL */

#define DDI0_OSC_XOSCHFCTL_LP_BUF_ITRIM_SHIFT   (0)       /* Bits 0-1 */
#define DDI0_OSC_XOSCHFCTL_LP_BUF_ITRIM_MASK    (3 << DDI0_OSC_XOSCHFCTL_LP_BUF_ITRIM_SHIFT)
#  define DDI0_OSC_XOSCHFCTL_LP_BUF_ITRIM(n)    ((uint32_t)(n) << DDI0_OSC_XOSCHFCTL_LP_BUF_ITRIM_SHIFT)
#define DDI0_OSC_XOSCHFCTL_HP_BUF_ITRIM_SHIFT   (2)       /* Bits 2-7 */
#define DDI0_OSC_XOSCHFCTL_HP_BUF_ITRIM_MASK    (7 << DDI0_OSC_XOSCHFCTL_HP_BUF_ITRIM_SHIFT)
#  define DDI0_OSC_XOSCHFCTL_HP_BUF_ITRIM(n)    ((uint32_t)(n) << DDI0_OSC_XOSCHFCTL_HP_BUF_ITRIM_SHIFT)
#define DDI0_OSC_XOSCHFCTL_BYPASS               (1 << 6)  /* Bit 6 */
#define DDI0_OSC_XOSCHFCTL_PEAK_DET_ITRIM_SHIFT (8)       /* Bits 8-9 */
#define DDI0_OSC_XOSCHFCTL_PEAK_DET_ITRIM_MASK  (3 << DDI0_OSC_XOSCHFCTL_PEAK_DET_ITRIM_SHIFT)
#  define DDI0_OSC_XOSCHFCTL_PEAK_DET_ITRIM(n)  ((uint32_t)(n) << DDI0_OSC_XOSCHFCTL_PEAK_DET_ITRIM_SHIFT)
#define DDI0_OSC_XOSCHFCTL_TCXO_MODE            (1 << 12) /* Bit 12: Enable qualifications to TXCO clock (if BYPASS=1) */
#define DDI0_OSC_XOSCHFCTL_TCXO_MODE_XOSC_HF_EN (1 << 13) /* Bit 13: Enable XOSC_HF (if TCX0_MODE=1) */

/* DDI0_OSC_LFOSCCTL */

#define DDI0_OSC_LFOSCCTL_RCOSCLF_CTUNE_TRIM_SHIFT    (0)       /* Bits 0-7 */
#define DDI0_OSC_LFOSCCTL_RCOSCLF_CTUNE_TRIM_MASK     (0xff << DDI0_OSC_LFOSCCTL_RCOSCLF_CTUNE_TRIM_SHIFT)
#  define DDI0_OSC_LFOSCCTL_RCOSCLF_CTUNE_TRIM(n)     ((uint32_t)(n) << DDI0_OSC_LFOSCCTL_RCOSCLF_CTUNE_TRIM_SHIFT)
#define DDI0_OSC_LFOSCCTL_RCOSCLF_RTUNE_TRIM_SHIFT    (8)       /* Bits 8-9 */
#define DDI0_OSC_LFOSCCTL_RCOSCLF_RTUNE_TRIM_MASK     (3 << DDI0_OSC_LFOSCCTL_RCOSCLF_RTUNE_TRIM_SHIFT)
#  define DDI0_OSC_LFOSCCTL_RCOSCLF_RTUNE_TRIM_7P5MEG (0 << DDI0_OSC_LFOSCCTL_RCOSCLF_RTUNE_TRIM_SHIFT)
#  define DDI0_OSC_LFOSCCTL_RCOSCLF_RTUNE_TRIM_7P0MEG (1 << DDI0_OSC_LFOSCCTL_RCOSCLF_RTUNE_TRIM_SHIFT)
#  define DDI0_OSC_LFOSCCTL_RCOSCLF_RTUNE_TRIM_6P5MEG (2 << DDI0_OSC_LFOSCCTL_RCOSCLF_RTUNE_TRIM_SHIFT)
#  define DDI0_OSC_LFOSCCTL_RCOSCLF_RTUNE_TRIM_6P0MEG (3 << DDI0_OSC_LFOSCCTL_RCOSCLF_RTUNE_TRIM_SHIFT)
#define DDI0_OSC_LFOSCCTL_XOSCLF_CMIRRWR_RATIO_SHIFT  (18)      /* Bits 18-21 */
#define DDI0_OSC_LFOSCCTL_XOSCLF_CMIRRWR_RATIO_MASK   (15 << DDI0_OSC_LFOSCCTL_XOSCLF_CMIRRWR_RATIO_SHIFT)
#  define DDI0_OSC_LFOSCCTL_XOSCLF_CMIRRWR_RATIO(n)   ((uint32_t)(n) << DDI0_OSC_LFOSCCTL_XOSCLF_CMIRRWR_RATIO_SHIFT)
#define DDI0_OSC_LFOSCCTL_XOSCLF_REGULATOR_TRIM_SHIFT (22)      /* Bits 22-23 */
#define DDI0_OSC_LFOSCCTL_XOSCLF_REGULATOR_TRIM_MASK  (3 << DDI0_OSC_LFOSCCTL_XOSCLF_REGULATOR_TRIM_SHIFT)
#  define DDI0_OSC_LFOSCCTL_XOSCLF_REGULATOR_TRIM(n)  ((uint32_t)(n) << DDI0_OSC_LFOSCCTL_XOSCLF_REGULATOR_TRIM_SHIFT)

/* DDI0_OSC_RCOSCHFCTL */

